examples/render_all_grammars/dot/tests_functional_regressions_issue140_B.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


35528312 -> 35533848[arrowtail=diamond, dir=both, headlabel="x 1..*"]
35528312[ label="{Model|}"]

35533848 -> 35539384[arrowtail=diamond, dir=both, headlabel="r 1..*"]
35533848[ label="{X|+name:ID\l}"]

35539384[ label="{*R|}"]
35539384 -> 35544920 [dir=back]
35539384 -> 35141768 [dir=back]

35544920 -> 35022760[headlabel="ref "]
35544920[ label="{R1|}"]

35136520[ label="{ID|}"]

35142712[ label="{STRING|}"]

35148248[ label="{BOOL|}"]

35153784[ label="{INT|}"]

35159320[ label="{FLOAT|}"]

35512424[ label="{STRICTFLOAT|}"]

35517960[ label="{NUMBER|}"]
35517960 -> 35512424 [dir=back]
35517960 -> 35153784 [dir=back]

35088904[ label="{BASETYPE|}"]
35088904 -> 35517960 [dir=back]
35088904 -> 35159320 [dir=back]
35088904 -> 35148248 [dir=back]
35088904 -> 35136520 [dir=back]
35088904 -> 35142712 [dir=back]

34652840[ label="{*OBJECT|}"]
34652840 -> 35088904 [dir=back]

34999992 -> 35022760[arrowtail=diamond, dir=both, headlabel="es 1..*"]
34999992[ label="{Model|}"]

35022760 -> 35121128[arrowtail=diamond, dir=both, headlabel="c 1..*"]
35022760[ label="{E|+name:ID\l}"]

35121128[ label="{*C|}"]
35121128 -> 35141768 [dir=back]

35141768 -> 35158376[arrowtail=diamond, dir=both, headlabel="t "]
35141768[ label="{C1|+name:ID\l}"]

35158376[ label="{TXT|+txt:STRING\l}"]


}
