examples/render_all_grammars/pu/tests_functional_regressions_issue140_B.pu
@startuml
            set namespaceSeparator .
        B.Model *-- "1..*" B.X
class B.Model  {
}


B.X *-- "1..*" B.R
class B.X  {
ID name
}


class B.R <<abstract>> {
}

B.R <|-- B.R1
B.R <|-- A.C1

B.R1 o-- A.E
class B.R1  {
}


class ID <<match>> {
}


class STRING <<match>> {
}


class BOOL <<match>> {
}


class INT <<match>> {
}


class FLOAT <<match>> {
}


class STRICTFLOAT <<match>> {
}


class NUMBER <<match>> {
}

NUMBER <|-- STRICTFLOAT
NUMBER <|-- INT

class BASETYPE <<match>> {
}

BASETYPE <|-- NUMBER
BASETYPE <|-- FLOAT
BASETYPE <|-- BOOL
BASETYPE <|-- ID
BASETYPE <|-- STRING

class OBJECT <<abstract>> {
}

OBJECT <|-- BASETYPE

A.Model *-- "1..*" A.E
class A.Model  {
}


A.E *-- "1..*" A.C
class A.E  {
ID name
}


class A.C <<abstract>> {
}

A.C <|-- A.C1

A.C1 *-- A.TXT
class A.C1  {
ID name
}


class A.TXT  {
STRING txt
}


@enduml
